bench/results/java25/20260424T144940Z/load.stdout.txt
{"ok": true, "tool": "wrk", "url": "http://localhost:8080/api/gateway/orders", "method": "GET", "duration_s": 120, "warmup_s": 60, "concurrency": 25, "threads": 4, "body_file": null, "header_file": null, "requests_per_sec": 5467.65, "p50": "4.18ms", "p95": "7.40ms", "p99": "8.73ms", "http_non2xx": "na", "socket_errors": {}, "raw_excerpt": "Running 2m test @ http://localhost:8080/api/gateway/orders\n  4 threads and 25 connections\n  Thread Stats   Avg      Stdev     Max   +/- Stdev\n    Latency     4.39ms    1.36ms  26.90ms   73.91%\n    Req/Sec     1.37k   133.55     1.61k    81.94%\n  Latency Distribution\n     50%    4.18ms\n     75%    5.07ms\n     90%    6.07ms\n     99%    8.73ms\n  656468 requests in 2.00m, 149.63MB read\nRequests/sec:   5467.65\nTransfer/sec:      1.25MB"}